Tekla Open API Reference for Tekla Structures 2025
BasePoint.CoordinateSystem Property
 Gets or sets the coordinate system.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string CoordinateSystem { get; set; }
Public Property CoordinateSystem As String
	Get
	Set
Property Value
Type: String
See Also
Reference
BasePoint Class
Tekla.Structures.Model Namespace